; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l27_p27_c27_g27_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 medicine)
	(crate-content crate6 medicine)
	(crate-content crate7 medicine)
	(crate-content crate8 medicine)
	(crate-content crate9 medicine)
	(crate-content crate10 medicine)
	(crate-content crate11 medicine)
	(crate-content crate12 medicine)
	(crate-content crate13 medicine)
	(crate-content crate14 medicine)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(crate-content crate26 medicine)
	(crate-content crate27 medicine)
	(at person1 loc27)
	(at person2 loc16)
	(at person3 loc13)
	(at person4 loc6)
	(at person5 loc12)
	(at person6 loc15)
	(at person7 loc3)
	(at person8 loc1)
	(at person9 loc5)
	(at person10 loc14)
	(at person11 loc10)
	(at person12 loc13)
	(at person13 loc18)
	(at person14 loc27)
	(at person15 loc22)
	(at person16 loc26)
	(at person17 loc21)
	(at person18 loc12)
	(at person19 loc12)
	(at person20 loc8)
	(at person21 loc6)
	(at person22 loc12)
	(at person23 loc25)
	(at person24 loc26)
	(at person25 loc3)
	(at person26 loc23)
	(at person27 loc27)
	(person-needs person1 medicine)
	(person-needs person2 medicine)
	(person-needs person3 medicine)
	(person-needs person4 food)
	(person-needs person4 medicine)
	(person-needs person7 medicine)
	(person-needs person8 medicine)
	(person-needs person9 medicine)
	(person-needs person10 medicine)
	(person-needs person11 medicine)
	(person-needs person12 medicine)
	(person-needs person13 medicine)
	(person-needs person14 medicine)
	(person-needs person16 medicine)
	(person-needs person17 food)
	(person-needs person17 medicine)
	(person-needs person18 medicine)
	(person-needs person19 food)
	(person-needs person20 medicine)
	(person-needs person21 medicine)
	(person-needs person22 medicine)
	(person-needs person23 medicine)
	(person-needs person24 medicine)
	(person-needs person25 food)
	(person-needs person25 medicine)
	(person-needs person26 medicine)
	(person-needs person27 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person7 medicine)
	(person-has person8 medicine)
	(person-has person9 medicine)
	(person-has person10 medicine)
	(person-has person11 medicine)
	(person-has person12 medicine)
	(person-has person13 medicine)
	(person-has person14 medicine)
	(person-has person16 medicine)
	(person-has person17 food)
	(person-has person17 medicine)
	(person-has person18 medicine)
	(person-has person19 food)
	(person-has person20 medicine)
	(person-has person21 medicine)
	(person-has person22 medicine)
	(person-has person23 medicine)
	(person-has person24 medicine)
	(person-has person25 food)
	(person-has person25 medicine)
	(person-has person26 medicine)
	(person-has person27 medicine)
	))
)

; plan
1. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 1 of 28
2. (grab-arm1 drone1 crate27 depot)
   deleted: (arm1-free drone1) (at crate27 depot)
   added: (arm1-load drone1 crate27)
   goals met: 1 of 28
3. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 0 of 28
4. (deliver-arm1 drone1 person2 crate27 medicine loc16)
   deleted: (arm1-load drone1 crate27) (person-needs person2 medicine)
   added: (arm1-free drone1) (person-has person2 medicine)
   goals met: 1 of 28
5. (move-drone drone1 loc16 loc1)
   deleted: (at drone1 loc16)
   added: (at drone1 loc1)
   goals met: 1 of 28
6. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 2 of 28
7. (grab-arm1 drone1 crate26 depot)
   deleted: (arm1-free drone1) (at crate26 depot)
   added: (arm1-load drone1 crate26)
   goals met: 2 of 28
8. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 1 of 28
9. (deliver-arm1 drone1 person8 crate26 medicine loc1)
   deleted: (arm1-load drone1 crate26) (person-needs person8 medicine)
   added: (arm1-free drone1) (person-has person8 medicine)
   goals met: 2 of 28
10. (move-drone drone1 loc1 loc5)
   deleted: (at drone1 loc1)
   added: (at drone1 loc5)
   goals met: 2 of 28
11. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 3 of 28
12. (grab-arm1 drone1 crate25 depot)
   deleted: (arm1-free drone1) (at crate25 depot)
   added: (arm1-load drone1 crate25)
   goals met: 3 of 28
13. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 2 of 28
14. (deliver-arm1 drone1 person9 crate25 medicine loc5)
   deleted: (arm1-load drone1 crate25) (person-needs person9 medicine)
   added: (arm1-free drone1) (person-has person9 medicine)
   goals met: 3 of 28
15. (move-drone drone1 loc5 loc14)
   deleted: (at drone1 loc5)
   added: (at drone1 loc14)
   goals met: 3 of 28
16. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 4 of 28
17. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 4 of 28
18. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 3 of 28
19. (deliver-arm1 drone1 person10 crate24 medicine loc14)
   deleted: (arm1-load drone1 crate24) (person-needs person10 medicine)
   added: (arm1-free drone1) (person-has person10 medicine)
   goals met: 4 of 28
20. (move-drone drone1 loc14 loc10)
   deleted: (at drone1 loc14)
   added: (at drone1 loc10)
   goals met: 4 of 28
21. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 5 of 28
22. (grab-arm1 drone1 crate23 depot)
   deleted: (arm1-free drone1) (at crate23 depot)
   added: (arm1-load drone1 crate23)
   goals met: 5 of 28
23. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 4 of 28
24. (deliver-arm1 drone1 person11 crate23 medicine loc10)
   deleted: (arm1-load drone1 crate23) (person-needs person11 medicine)
   added: (arm1-free drone1) (person-has person11 medicine)
   goals met: 5 of 28
25. (move-drone drone1 loc10 loc13)
   deleted: (at drone1 loc10)
   added: (at drone1 loc13)
   goals met: 5 of 28
26. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 6 of 28
27. (grab-arm1 drone1 crate22 depot)
   deleted: (arm1-free drone1) (at crate22 depot)
   added: (arm1-load drone1 crate22)
   goals met: 6 of 28
28. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 5 of 28
29. (deliver-arm1 drone1 person13 crate22 medicine loc18)
   deleted: (arm1-load drone1 crate22) (person-needs person13 medicine)
   added: (arm1-free drone1) (person-has person13 medicine)
   goals met: 6 of 28
30. (move-drone drone1 loc18 loc13)
   deleted: (at drone1 loc18)
   added: (at drone1 loc13)
   goals met: 6 of 28
31. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 7 of 28
32. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 7 of 28
33. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 6 of 28
34. (deliver-arm1 drone1 person20 crate21 medicine loc8)
   deleted: (arm1-load drone1 crate21) (person-needs person20 medicine)
   added: (arm1-free drone1) (person-has person20 medicine)
   goals met: 7 of 28
35. (move-drone drone1 loc8 loc13)
   deleted: (at drone1 loc8)
   added: (at drone1 loc13)
   goals met: 7 of 28
36. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 8 of 28
37. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 8 of 28
38. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 7 of 28
39. (deliver-arm1 drone1 person23 crate20 medicine loc25)
   deleted: (arm1-load drone1 crate20) (person-needs person23 medicine)
   added: (arm1-free drone1) (person-has person23 medicine)
   goals met: 8 of 28
40. (move-drone drone1 loc25 loc13)
   deleted: (at drone1 loc25)
   added: (at drone1 loc13)
   goals met: 8 of 28
41. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 9 of 28
42. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 9 of 28
43. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 8 of 28
44. (deliver-arm1 drone1 person26 crate19 medicine loc23)
   deleted: (arm1-load drone1 crate19) (person-needs person26 medicine)
   added: (arm1-free drone1) (person-has person26 medicine)
   goals met: 9 of 28
45. (move-drone drone1 loc23 loc13)
   deleted: (at drone1 loc23)
   added: (at drone1 loc13)
   goals met: 9 of 28
46. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 10 of 28
47. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 10 of 28
48. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 9 of 28
49. (deliver-arm1 drone1 person3 crate18 medicine loc13)
   deleted: (arm1-load drone1 crate18) (person-needs person3 medicine)
   added: (arm1-free drone1) (person-has person3 medicine)
   goals met: 10 of 28
50. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 11 of 28
51. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 11 of 28
52. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 10 of 28
53. (deliver-arm1 drone1 person12 crate17 medicine loc13)
   deleted: (arm1-load drone1 crate17) (person-needs person12 medicine)
   added: (arm1-free drone1) (person-has person12 medicine)
   goals met: 11 of 28
54. (move-drone drone1 loc13 loc21)
   deleted: (at drone1 loc13)
   added: (at drone1 loc21)
   goals met: 11 of 28
55. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 12 of 28
56. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 12 of 28
57. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 11 of 28
58. (deliver-arm2 drone1 person17 crate4 food loc21)
   deleted: (arm2-load drone1 crate4) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 12 of 28
59. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 13 of 28
60. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 13 of 28
61. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 12 of 28
62. (deliver-arm1 drone1 person17 crate16 medicine loc21)
   deleted: (arm1-load drone1 crate16) (person-needs person17 medicine)
   added: (arm1-free drone1) (person-has person17 medicine)
   goals met: 13 of 28
63. (move-drone drone1 loc21 loc6)
   deleted: (at drone1 loc21)
   added: (at drone1 loc6)
   goals met: 13 of 28
64. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 14 of 28
65. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 14 of 28
66. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 13 of 28
67. (deliver-arm2 drone1 person4 crate3 food loc6)
   deleted: (arm2-load drone1 crate3) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 14 of 28
68. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 15 of 28
69. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 15 of 28
70. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 14 of 28
71. (deliver-arm1 drone1 person4 crate15 medicine loc6)
   deleted: (arm1-load drone1 crate15) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 15 of 28
72. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 16 of 28
73. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 16 of 28
74. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 15 of 28
75. (deliver-arm1 drone1 person21 crate14 medicine loc6)
   deleted: (arm1-load drone1 crate14) (person-needs person21 medicine)
   added: (arm1-free drone1) (person-has person21 medicine)
   goals met: 16 of 28
76. (move-drone drone1 loc6 loc12)
   deleted: (at drone1 loc6)
   added: (at drone1 loc12)
   goals met: 16 of 28
77. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 17 of 28
78. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 17 of 28
79. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 16 of 28
80. (deliver-arm1 drone1 person18 crate13 medicine loc12)
   deleted: (arm1-load drone1 crate13) (person-needs person18 medicine)
   added: (arm1-free drone1) (person-has person18 medicine)
   goals met: 17 of 28
81. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 18 of 28
82. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 18 of 28
83. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 17 of 28
84. (deliver-arm2 drone1 person19 crate2 food loc12)
   deleted: (arm2-load drone1 crate2) (person-needs person19 food)
   added: (arm2-free drone1) (person-has person19 food)
   goals met: 18 of 28
85. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 19 of 28
86. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 19 of 28
87. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 18 of 28
88. (deliver-arm2 drone1 person25 crate1 food loc3)
   deleted: (arm2-load drone1 crate1) (person-needs person25 food)
   added: (arm2-free drone1) (person-has person25 food)
   goals met: 19 of 28
89. (move-drone drone1 loc3 loc12)
   deleted: (at drone1 loc3)
   added: (at drone1 loc12)
   goals met: 19 of 28
90. (deliver-arm1 drone1 person22 crate12 medicine loc12)
   deleted: (arm1-load drone1 crate12) (person-needs person22 medicine)
   added: (arm1-free drone1) (person-has person22 medicine)
   goals met: 20 of 28
91. (move-drone drone1 loc12 loc26)
   deleted: (at drone1 loc12)
   added: (at drone1 loc26)
   goals met: 20 of 28
92. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 21 of 28
93. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 21 of 28
94. (move-drone drone1 depot loc26)
   deleted: (at drone1 depot)
   added: (at drone1 loc26)
   goals met: 20 of 28
95. (deliver-arm2 drone1 person16 crate11 medicine loc26)
   deleted: (arm2-load drone1 crate11) (person-needs person16 medicine)
   added: (arm2-free drone1) (person-has person16 medicine)
   goals met: 21 of 28
96. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 22 of 28
97. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 22 of 28
98. (move-drone drone1 depot loc26)
   deleted: (at drone1 depot)
   added: (at drone1 loc26)
   goals met: 21 of 28
99. (deliver-arm2 drone1 person24 crate10 medicine loc26)
   deleted: (arm2-load drone1 crate10) (person-needs person24 medicine)
   added: (arm2-free drone1) (person-has person24 medicine)
   goals met: 22 of 28
100. (move-drone drone1 loc26 loc3)
   deleted: (at drone1 loc26)
   added: (at drone1 loc3)
   goals met: 22 of 28
101. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 23 of 28
102. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 23 of 28
103. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 22 of 28
104. (deliver-arm2 drone1 person7 crate9 medicine loc3)
   deleted: (arm2-load drone1 crate9) (person-needs person7 medicine)
   added: (arm2-free drone1) (person-has person7 medicine)
   goals met: 23 of 28
105. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 24 of 28
106. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 24 of 28
107. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 23 of 28
108. (deliver-arm2 drone1 person25 crate8 medicine loc3)
   deleted: (arm2-load drone1 crate8) (person-needs person25 medicine)
   added: (arm2-free drone1) (person-has person25 medicine)
   goals met: 24 of 28
109. (move-drone drone1 loc3 loc27)
   deleted: (at drone1 loc3)
   added: (at drone1 loc27)
   goals met: 24 of 28
110. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 25 of 28
111. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 25 of 28
112. (move-drone drone1 depot loc27)
   deleted: (at drone1 depot)
   added: (at drone1 loc27)
   goals met: 24 of 28
113. (deliver-arm2 drone1 person1 crate7 medicine loc27)
   deleted: (arm2-load drone1 crate7) (person-needs person1 medicine)
   added: (arm2-free drone1) (person-has person1 medicine)
   goals met: 25 of 28
114. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 26 of 28
115. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 26 of 28
116. (move-drone drone1 depot loc27)
   deleted: (at drone1 depot)
   added: (at drone1 loc27)
   goals met: 25 of 28
117. (deliver-arm2 drone1 person14 crate6 medicine loc27)
   deleted: (arm2-load drone1 crate6) (person-needs person14 medicine)
   added: (arm2-free drone1) (person-has person14 medicine)
   goals met: 26 of 28
118. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 27 of 28
119. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 27 of 28
120. (move-drone drone1 depot loc27)
   deleted: (at drone1 depot)
   added: (at drone1 loc27)
   goals met: 26 of 28
121. (deliver-arm2 drone1 person27 crate5 medicine loc27)
   deleted: (arm2-load drone1 crate5) (person-needs person27 medicine)
   added: (arm2-free drone1) (person-has person27 medicine)
   goals met: 27 of 28
122. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 28 of 28
